# HWidth

## Description
Function HWidth returns the width of the referenced object.&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION HWidth(h : HANDLE) : REAL;
```

```python

def vs.HWidth(h):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Examples
```pascal
w:=HWidth(HandleToObj);

```

## Version
Availability: from MiniCAD
## Category
* Object Info